src/Documents/Scan_СпецификацияСтандартнойМодели/Scan_СпецификацияСтандартнойМодели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_СпецификацияСтандартнойМодели</name>
  <attributes>
    <name>ДействуетСДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетСPP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВРазделеКалькуляции</name>
    <type>
      <types>CatalogRef.Scan_РазделыКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикНадстроек</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикОборудования</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВКалькуляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторнирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SOrder</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаАннулирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяСебестоимостьСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НезагруженныеОпции</name>
    <attributes>
      <name>Исполнение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Надстройки</name>
    <attributes>
      <name>НоменклатураНадстроек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>НоменклатураНадстроек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Scan_СтатусыЗаявокНаДействие/Scan_СтатусыЗаявокНаДействие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтатусыЗаявокНаДействие</name>
  <predefined>
    <items>
      <name>Аннулирована</name>
      <description>Аннулирована</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ДоставкаЗавершена</name>
      <description>Доставка завершена</description>
    </items>
    <items>
      <name>ЗаявкаОтправлена</name>
      <description>Заявка отправлена</description>
    </items>
    <items>
      <name>Исполнена</name>
      <description>Исполнена</description>
    </items>
    <items>
      <name>Новая</name>
      <description>Новая</description>
    </items>
    <items>
      <name>Отклонена</name>
      <description>Отклонена</description>
    </items>
    <items>
      <name>Подтверждена</name>
      <description>Подтверждена</description>
    </items>
  </predefined>
  <attributes>
    <name>НедоступноДляВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок сортировки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <comment>Цвет заказ-наряда в журналах</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/Scan_СпецификацияСтандартнойМодели/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus pechek 12.03.2020  15466 +++
	
	// rarus kabany 25.05.2021 17784 +++
	мПрисоединенныхФайлов = ПолучитьЗначениеПараметраСтруктуры(Параметры,"СписокПрисоединенныхФайлов", Неопределено);
	Если мПрисоединенныхФайлов <> Неопределено и мПрисоединенныхФайлов.Количество() > 0 Тогда		
	СписокПрисоединенныхФайловАдресс =	ПоместитьВоВременноеХранилище(мПрисоединенныхФайлов, Новый УникальныйИдентификатор)		
	КонецЕсли;
	// rarus kabany 25.05.2021 17784 ---
	
	//rarus pechek 30.03.2020  15466 +++
	Если Объект.НезагруженныеОпции.Количество() = 0 Тогда
		ЭтаФорма.Элементы.ГруппаПроверитьЗагрузку.Скрыть();
	КонецЕсли;
	//rarus pechek 30.03.2020  15466 ---
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// Параметры документа ++
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь() ;
		Объект.Организация = ТекущийПользователь.Организация;
		Объект.ПодразделениеКомпании = ТекущийПользователь.ПодразделениеОрганизации;
		Объект.Автор = ТекущийПользователь;
		Объект.Менеджер = ТекущийПользователь;
		Объект.ДатаСоздания = ТекущаяДата(); // rarus agar 27.04.2020 15466
		Объект.Дата = ТекущаяДата();
		Объект.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");
		//rarus vikhle 22.04.2020 mt 15695 +++	
		Scan_ВспомогательныеФункцииСервер.ЗаполнитьКомпаниюИКонтрагента(ТекущийПользователь,Объект.Компания,Объект.Контрагент);
		//rarus vikhle 22.04.2020 mt 15695 ---
		// Параметры документа --
	КонецЕсли;
	УправлениеДиалогомНаСервере(); 
	Scan_СборСтатистики.Scan_ПриОткрытии("Документы", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры //rarus pechek 12.03.2020  15466 ---

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();//rarus vikhle 07.05.2020 mt 15695
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) //rarus pechek 12.03.2020  15466 +++
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Модифицированность Тогда
		СтандартнаяОбработка = Ложь;
		ТекстПредупреждения = "Документ не был записан. Данные не будут сохранены.";
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект, );
		ПоказатьВопрос(Оповещение, ТекстПредупреждения,РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.ОК, "Предупреждение");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры //rarus pechek 12.03.2020  15466 ---

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт //rarus bonmak 26.03.2020 15466 ++
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры //rarus bonmak 26.03.2020 15466 -- 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) //rarus pechek 12.03.2020  15466 +++
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры   //rarus pechek 12.03.2020  15466 ---

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)//rarus pechek 12.03.2020  15466 +++
	// rarus agar 26.04.2021 17394 ++
	//устанавливаем статусы док-та при проведении
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Объект.ИспользуетсяВКалькуляции Тогда
	//	Если Объект.Статус = Справочники.Scan_СтатусыЗаявокНаДействие.Новая Тогда
	//		ТекущийОбъект.Статус = Справочники.Scan_СтатусыЗаявокНаДействие.ВРаботе;
	//	КонецЕсли;
	//ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Объект.ИспользуетсяВКалькуляции Тогда
	//	Сообщить(НСтр("ru = 'Не установлен флаг Используется в калькуляции. Будет установлен статус заявки Новая!'; en = 'The flag Used in costing is not set. The application status will be set to New'"));
	//	ТекущийОбъект.Статус = Справочники.Scan_СтатусыЗаявокНаДействие.Новая;
	//Иначе
	// rarus agar 26.04.2021 17394 --
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ТекущийОбъект.Статус = Справочники.Scan_СтатусыЗаявокНаДействие.Новая;
	КонецЕсли;
	
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюДокумента(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 

КонецПроцедуры //rarus pechek 12.03.2020  15466 ---

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)    //rarus pechek 12.03.2020  15466 +++
	// Вызываем общий обработчик события
	Scan_УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
КонецПроцедуры //rarus pechek 12.03.2020  15466 ---

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки) //rarus pechek 12.03.2020  15466 +++
	// Вызываем общий обработчик события
	Scan_УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
КонецПроцедуры //rarus pechek 12.03.2020  15466 ---
#КонецОбласти

#Область ВспомогательныеФункции
&НаСервере
Процедура УправлениеДиалогомНаСервере() //rarus pechek 12.03.2020  15466 +++
	
	ПользовательСотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователи.ТекущийПользователь(), "ПользовательСотрудник"); // rarus vikhle 21.12.2021 m 18269
	
	Элементы.ПлановаяСебестоимостьСНДС.Видимость = ПользовательСотрудник; // rarus vikhle 21.12.2021 m 18269
	
	Если Объект.Статус = Справочники.Scan_СтатусыЗаявокНаДействие.Аннулирована Тогда
		Элементы.ГруппаФон.ТолькоПросмотр = Истина;
		Элементы.ФормаАннулировать.Доступность = ложь; //rarus ozhnik 17813 10.06.2021 + 
		Элементы.ФормаКорректировать.Доступность = ложь; //rarus ozhnik 17813 10.06.2021 + 
	Иначе
		Элементы.ПричинаАннулирования.Видимость = Ложь; //rarus ozhnik 17813 09.06.2021 + 
	КонецЕсли;
	
	// rarus agar 26.04.2021 17394 ++
	//Если Объект.Ссылка.Проведен И Объект.ИспользуетсяВКалькуляции Тогда
	//	Элементы.ГруппаФон.ТолькоПросмотр = Истина;
	//КонецЕсли;
	// rarus agar 26.04.2021 17394 --
	
	Если Объект.Статус = Справочники.Scan_СтатусыЗаявокНаДействие.ПустаяСсылка() Тогда
		Объект.Статус = Справочники.Scan_СтатусыЗаявокНаДействие.Новая;
	КонецЕсли;
	РазрешеноАннулировать = Scan_ПраваИНастройки.Scan_Право("РазрешитьАннулированиеДокументаСпецификацияСтандартнойМодели");
	Элементы.Модель.ТолькоПросмотр = не РазрешеноАннулировать;
	Элементы.ФормаАннулировать.Доступность = РазрешеноАннулировать и не Объект.Статус = Справочники.Scan_СтатусыЗаявокНаДействие.Аннулирована;
	// rarus agar 26.04.2021 17394 ++
	Элементы.ФормаВРаботу.Видимость = Объект.Статус = ПредопределенноеЗначение("Справочник.Scan_СтатусыЗаявокНаДействие.Новая");
	// rarus agar 26.04.2021 17394 --
		
КонецПроцедуры //rarus pechek 12.03.2020  15466 ---
#КонецОбласти

#Область Аннулирование
&НаКлиенте
Процедура АннулироватьДокумент(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Или ЭтаФорма.Модифицированность Тогда
		//rarus bonmak 26.03.2020 15466 ++
		ТекстСообщения = НСтр("ru = 'Для аннулирования заявки необходимо записать документ.'; 
		|en = 'To cancel the application, you must write a document.'");
		Сообщить(ТекстСообщения);
		//rarus bonmak 26.03.2020 15466 --
	Иначе
		Scan_ВспомогательныеФункцииКлиент.ОбработатьИзменениеСпецификацииСтандартнойМодели(Ложь, Объект.Ссылка, ЭтаФорма);		
	КонецЕсли;
КонецПроцедуры  

#КонецОбласти

#Область Корректировка
&НаКлиенте
Процедура КорректироватьДокумент(Команда) //rarus pechek 12.03.2020  15466 +++	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Или ЭтаФорма.Модифицированность Тогда
		Сообщить(НСтр("ru = 'Для корректировки заявки необходимо записать документ'; en = 'To correct the application, you must write a document'"));	
	Иначе
		Scan_ВспомогательныеФункцииКлиент.ОбработатьИзменениеСпецификацииСтандартнойМодели(Истина, Объект.Ссылка, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры //rarus pechek 12.03.2020  15466 ---
#КонецОбласти

#Область ПрикрепитьВнешнийФайл  
&НаКлиенте
Процедура ПрикрепитьФайл(Команда) //rarus pechek 12.03.2020  15466 +++
	Документ = Объект.Ссылка;
	РаботаСФайламиКлиент.ДобавитьФайлы(Документ, ЭтаФорма.УникальныйИдентификатор, , );	
КонецПроцедуры //rarus pechek 12.03.2020  15466 ---
#КонецОбласти

#Область ЗагрузитьФайлСпецификацию 
&НаКлиенте
Процедура ЗагрузитьСпецификацию(Команда) //rarus pechek 12.03.2020  15466 +++
	//rarus agar 28.10.2020 16659 ++
	//Если Объект.Спецификация.Количество() > 0 Тогда
	//	ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьСпецификациюЗавершение", ЭтотОбъект),
	//	Нстр("ru = 'Таблица спецификаций заполнена. Данные будут очищены. Продолжить?'; en = 'The specification table is full. Data will be cleared. Proceed?'"), РежимДиалогаВопрос.ДаНет);
	//Иначе
	//	ВыполнитьЗагрузкуСпецификаций();
	//КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьСпецификациюФрагмент", ЭтотОбъект),
		Нстр("ru = 'Перед загрузкой необходимо записать документ. Продолжить?'; en = 'It is necessary to save the document. Proceed?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		Если Объект.Спецификация.Количество() > 0 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьСпецификациюЗавершение", ЭтотОбъект),
			Нстр("ru = 'Таблица спецификаций заполнена. Данные будут очищены. Продолжить?'; en = 'The specification table is full. Data will be cleared. Proceed?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыполнитьЗагрузкуСпецификаций();
		КонецЕсли;
	КонецЕсли;
	
	//rarus agar 28.10.2020 16659 --
КонецПроцедуры //rarus pechek 12.03.2020  15466 ---

//rarus agar 28.10.2020 16659 ++
&НаКлиенте
Процедура ЗагрузитьСпецификациюФрагмент(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если  РезультатВопроса = КодВозвратаДиалога.Да 
		И Записать()
		Тогда
		Если Объект.Спецификация.Количество() > 0 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьСпецификациюЗавершение", ЭтотОбъект),
			Нстр("ru = 'Таблица спецификаций заполнена. Данные будут очищены. Продолжить?'; en = 'The specification table is full. Data will be cleared. Proceed?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыполнитьЗагрузкуСпецификаций();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 28.10.2020 16659 --

&НаКлиенте
Процедура ЗагрузитьСпецификациюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт  //rarus pechek 12.03.2020  15466 +++
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗагрузкуСпецификаций();
	ИначеЕсли ТипЗнч(РезультатВопроса) = Тип("Структура") Тогда
		//rarus bonmak 27.03.2020 15466 ++
		//ЗагрузитьСпецификациюНаСервере(РезультатВопроса.ПутьКФайлу);
		ЗагрузитьСпецификациюНаСервереИзФайла(РезультатВопроса);
		//rarus bonmak 27.03.2020 15466 --
	КонецЕсли;	
КонецПроцедуры //rarus pechek 12.03.2020  15466 ---	

&НаКлиенте
Процедура ВыполнитьЗагрузкуСпецификаций() //rarus pechek 12.03.2020  15466 +++ 
	Модифицированность = Истина;
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьСпецификациюЗавершение", ЭтотОбъект);	
	ПараметрыКоманды = Новый Структура("ИмяКоманды", "ЗагрузитьСпецификацию");
	ОткрытьФорму("ОбщаяФорма.Scan_ФормаЗагрузкиФайла",ПараметрыКоманды, ЭтотОбъект,,,,Обработчик, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры	//rarus pechek 12.03.2020  15466 ---

&НаСервереБезКонтекста
Функция ОбновитьОпцииПродуктов(Variant)//rarus pechek 23.03.2020  15466 +++
	ОпцииПродуктов = Справочники.Scan_ОпцииПродуктов.ПустаяСсылка();
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Scan_ОпцииПродуктов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Scan_ОпцииПродуктов КАК Scan_ОпцииПродуктов
	               |ГДЕ
	               |	Scan_ОпцииПродуктов.Код = &Код
	               |	И НЕ Scan_ОпцииПродуктов.ПометкаУдаления
	               |	И НЕ Scan_ОпцииПродуктов.ЭтоГруппа";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Код",Variant.VariantCode);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Наименование = Variant.ExecutionDescription;
		Объект.Записать();
		ОпцииПродуктов = Объект.Ссылка;
	КонецЕсли;
	Возврат ОпцииПродуктов;
КонецФункции //rarus pechek 23.03.2020  15466 ---

&НаКлиенте
Процедура ЗагрузитьСпецификациюНаСервереИзФайла(ЗначенияВыбранныхПараметров) //rarus bonmak 27.03.2020 15466 ++		
	ТекПутьКФайлу = ЗначенияВыбранныхПараметров.ПутьКФайлу;
	#Если Не ВебКлиент Тогда
		ТекДанные = Новый ДвоичныеДанные(ТекПутьКФайлу);
		АдресВХранилище = ПоместитьВоВременноеХранилище(ТекДанные);
		ЗначенияВыбранныхПараметров.Вставить("АдресХранилища", АдресВХранилище);
		ЗагрузитьСпецификациюНаСервере(ЗначенияВыбранныхПараметров);
	#Иначе
		ПомещаемыеФайлыМассив = Новый Массив;
		ПомещаемыеФайлыМассив.Добавить(Новый ОписаниеПередаваемогоФайла(ТекПутьКФайлу, ""));
		Описание = Новый ОписаниеОповещения("ЗагрузитьСпецификациюНаСервереИзФайлаЗавершение", ЭтотОбъект, Новый Структура("ЗначенияВыбранныхПараметров", ЗначенияВыбранныхПараметров));
		НачатьПомещениеФайлов(Описание, ПомещаемыеФайлыМассив, , Ложь, УникальныйИдентификатор);
	#КонецЕсли	
	
КонецПроцедуры //rarus bonmak 27.03.2020 15466 --

&НаКлиенте
Процедура ЗагрузитьСпецификациюНаСервереИзФайлаЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт //rarus bonmak 27.03.2020 15466 ++
	
	ЗначенияВыбранныхПараметров = ДополнительныеПараметры.ЗначенияВыбранныхПараметров;
		
	Если ПомещенныеФайлы.Количество() = 0 Тогда
		Сообщить(НСтр("ru = 'Ошибка при обработке файла'; en = 'Error'"));
	Иначе
		ЗначенияВыбранныхПараметров.Вставить("АдресХранилища", ПомещенныеФайлы[0].Хранение);
	КонецЕсли;
	
	ЗагрузитьСпецификациюНаСервере(ЗначенияВыбранныхПараметров);

КонецПроцедуры //rarus bonmak 27.03.2020 15466 --

&НаСервере
Процедура ЗагрузитьСпецификациюНаСервере(СтруктураОтвета) //rarus bonmak 27.03.2020 15466 изменил первый параметр
	//rarus bonmak 27.03.2020 15466 ++
	фИмяФайла = "StandartSpecific.xml";
	ДД = ПолучитьИзВременногоХранилища(СтруктураОтвета.АдресХранилища);
	Путь = КаталогВременныхФайлов();
	ДД.Записать(Путь+фИмяФайла); 
	ИмяФайла = Путь+фИмяФайла;
	//rarus bonmak 27.03.2020 15466 --
	
	Объект.НезагруженныеОпции.Очистить();
	Объект.Спецификация.Очистить();
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	ТипЗначенияXDTO = ФабрикаXDTO.Тип("http://xmlns.scania.com/factory/schema/productdata/v1", "ЗагрузкаСпецификаций");
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипЗначенияXDTO);
	Для Каждого СтрокаVariant Из ОбъектXDTO.EtelSpecification.ListOfVariant.Variant Цикл
		//rarus agar 30.10.2020 16659 ++
		Если СтрНайти(СтрокаVariant.Execution, "-") <> 0 Тогда
			Продолжить;
		КонецЕсли;
		//rarus agar 30.10.2020 16659 --
		
		Опция = ОбновитьОпцииПродуктов(СтрокаVariant);
		Если Опция.Пустая() Тогда
			НоваяСтрока = Объект.НезагруженныеОпции.Добавить();
			НоваяСтрока.Исполнение = СтрокаVariant.VariantCode;
			НоваяСтрока.Описание = СокрЛП(СтрокаVariant.FamilyDescription) + " " + СокрЛП(СтрокаVariant.ExecutionDescription);
		Иначе
			НоваяСтрока = Объект.Спецификация.Добавить();
			НоваяСтрока.Опция = Опция;
		КонецЕсли;
	КонецЦикла;
	
	//rarus agar 10.06.2020 15466 ++
	Попытка
		ДействуетСPP = Сред(ОбъектXDTO.EtelSpecification.ConfirmedPartPeriod, 3);
		Объект.ДействуетСPP = Сред(ДействуетСPP, 1, 2)+" "+Сред(ДействуетСPP, 3, 2)+" "+Сред(ДействуетСPP, 5);
	Исключение КонецПопытки;
	//rarus agar 10.06.2020 15466 --
	
	Если Объект.НезагруженныеОпции.Количество()>0 Тогда
		Сообщить(НСтр("ru = 'Загрузка завершена. Опции загружены не полностью. Просьба обратиться к администратору 1ДБ'; en = 'Loading is complete. Options are not fully loaded. Please contact the 1DB administrator'"));
	КонецЕсли;
	
	//rarus bonmak 27.03.2020 15466 ++
	ЧтениеXML.Закрыть();
	УдалитьФайлы(Путь, фИмяФайла);
	//rarus bonmak 27.03.2020 15466 --
	
	//rarus agar 14.10.2020 16659 ++
	//ОбновитьПрисоединенныйФайлНаСервере(СтруктураОтвета); //rarus vikhle 27.11.2020 mt 16638 перенес в общий модуль
	//rarus agar 14.10.2020 16659 --
	
	Scan_ВспомогательныеФункцииСервер.ОбновитьПрисоединенныйФайлНаСервере(СтруктураОтвета,Объект.Ссылка); //rarus vikhle 27.11.2020 mt 16638
		
КонецПроцедуры
//rarus bonmak 09.08.2021 16834 ++
//rarus agar 14.10.2020 16659 ++
//Процедура ОбновитьПрисоединенныйФайлНаСервере(СтруктураОтвета)
	
	//rarus vikhle 27.11.2020 mt 16638 +++ перенес в общий модуль
	//ИмяФайла = СтруктураОтвета.ПутьКФайлу;
	//Пока Не СтрНайти(ИмяФайла, "\") = 0 Цикл
	//	ИмяФайла = Сред(ИмяФайла, СтрНайти(ИмяФайла,"\") +1);
	//КонецЦикла;
	//
	//МассивИмениФайла = СтрРазделить(ИмяФайла, ".", Ложь);
	//
	//Если МассивИмениФайла.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ИмяФайлаБезРасширения = МассивИмениФайла[0];
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ВладелецФайла",     Объект.Ссылка);
	//Запрос.УстановитьПараметр("НаименованиеФайла", ИмяФайлаБезРасширения);
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Scan_СпецификацияСтандартнойМоделиПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайл
	//|ИЗ
	//|	Справочник.Scan_СпецификацияСтандартнойМоделиПрисоединенныеФайлы КАК Scan_СпецификацияСтандартнойМоделиПрисоединенныеФайлы
	//|ГДЕ
	//|	Scan_СпецификацияСтандартнойМоделиПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	//|	И Scan_СпецификацияСтандартнойМоделиПрисоединенныеФайлы.Наименование = &НаименованиеФайла";
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда
	//	ПараметрыФайла = Новый Структура;
	//	ПараметрыФайла.Вставить("Автор", Пользователи.АвторизованныйПользователь());
	//	ПараметрыФайла.Вставить("ВладелецФайлов", Объект.Ссылка);
	//	ПараметрыФайла.Вставить("ИмяБезРасширения", ИмяФайлаБезРасширения);
	//	ПараметрыФайла.Вставить("РасширениеБезТочки", СтруктураОтвета.ФорматФайла);
	//	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", );
	//	
	//	ДобавленныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, СтруктураОтвета.АдресХранилища);
	//	Если ДобавленныйФайл.Пустая() Тогда
	//		Сообщить(НСтр("ru = 'Не удалось прикрепить загружаемый файл к документу.'; 
	//		              |en = 'Failed to attach the file to the document.'"));
	//	Иначе
	//		Сообщить(НСтр("ru = 'Загружаемый файл прикреплен к документу.'; 
	//		              |en = 'The file has been attached to the document.'"));
	//	КонецЕсли;
	//Иначе
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Выборка.Следующий();
	//	
	//	ИнформацияОФайле = Новый Структура;
	//	ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", СтруктураОтвета.АдресХранилища);
	//	ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
	//	
	//	РаботаСФайлами.ОбновитьФайл(Выборка.ПрисоединенныйФайл, ИнформацияОФайле);
	//КонецЕсли;
	//rarus vikhle 27.11.2020 mt 16638 ---
//КонецПроцедуры
//rarus agar 14.10.2020 16659 --
//rarus bonmak 09.08.2021 16834 --
#КонецОбласти

#Область ПараметрыДокумента

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт  //rarus pechek 23.03.2020  15466 +++
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
КонецПроцедуры //rarus pechek 23.03.2020  15466 ---

&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)//rarus pechek 23.03.2020  15466 +++ 
	// Вызываем общий обработчик события
	Если НЕ Scan_УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	УправлениеДиалогомНаСервере();	
КонецПроцедуры //rarus pechek 23.03.2020  15466 ---

//rarus pechek 23.03.2020  15466 +++

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	Scan_УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);	
КонецПроцедуры //rarus pechek 23.03.2020  15466 ---

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка) //rarus pechek 23.03.2020  15466 +++
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	Scan_УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект, ПараметрыДействия_НастроитьПараметрыДокумента());
КонецПроцедуры   //rarus pechek 23.03.2020  15466 ---

&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт //rarus pechek 23.03.2020  15466 +++
	// Определим структуру параметров обработки текущего события
	Если Команда.Имя="НастроитьПараметрыДокумента" Тогда
		ПараметрыДействия = ПараметрыДействия_НастроитьПараметрыДокумента();
	иначе
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ Scan_УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	УправлениеДиалогомНаСервере();
КонецПроцедуры //rarus pechek 23.03.2020  15466 ---

&НаКлиенте
Функция ПараметрыДействия_НастроитьПараметрыДокумента()//rarus pechek 23.03.2020  15466 +++
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("ЗапретитьИзменение_ВалютаДокумента", Истина);
	Возврат ПараметрыДействия;
КонецФункции //rarus pechek 23.03.2020  15466 ---

&НаСервере
Процедура ПолучитьСтатусДокумента(Статус) //rarus pechek 23.03.2020  15466 +++
	ДанныеФормы = ДанныеФормыВЗначение(ЭтаФорма.Объект, Тип("ДокументОбъект.Scan_СпецификацияСтандартнойМодели"));
	ДанныеФормы.Статус = Справочники.Scan_СтатусыЗаявокНаДействие[Статус];
	//rarus pechek 30.03.2020  15466 +++
	ДанныеФормы.Сторнирован = Истина;
	//rarus pechek 30.03.2020  15466 --- 
	ДанныеФормы.ПричинаАннулирования = "Аннулирован по причине корректировки"; //rarus ozhnik 17813 09.06.2021 +
	ДанныеФормы.Записать();
	ЗначениеВДанныеФормы(ДанныеФормы, ЭтаФорма.Объект); 
КонецПроцедуры //rarus pechek 23.03.2020  15466 ---

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)  //rarus pechek 23.03.2020  15466 +++
	Если ИмяСобытия = "ИзменениеСтатуса" Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
		ПолучитьСтатусДокумента("Аннулирована");
		ОбновитьОтображениеДанных(Элементы.Статус);
	КонецЕсли;
КонецПроцедуры //rarus pechek 23.03.2020  15466 --- 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//rarus agar 14.05.2020  15466 Доп1 ++
&НаКлиенте
Процедура ДействуетСPPПриИзменении(Элемент)
	
	ПриИзмененииДатыИлиPartPeriod();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетСДатыПриИзменении(Элемент)
	
	ПриИзмененииДатыИлиPartPeriod();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДатыИлиPartPeriod()
	
	Если  ЗначениеЗаполнено(Объект.ДействуетСДаты)
		И ЗначениеЗаполнено(Объект.ДействуетСPP)
		И Не Scan_ЦенообразованиеСервер.ДатаСоответствуетPartPeriod(Объект.ДействуетСДаты, Объект.ДействуетСPP) 
		Тогда
		Сообщить(НСтр("ru = 'Указанный Part Period не соответствует дате начала действия'; en = 'The Part Period does not match the From Date'"));
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 14.05.2020  15466 Доп1 --

#КонецОбласти

// rarus agar 26.04.2021 17394 ++
&НаКлиенте
Процедура ВРаботу(Команда)
	
	ВРаботуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВРаботуНаСервере()
	
	Объект.Статус = ПредопределенноеЗначение("Справочник.Scan_СтатусыЗаявокНаДействие.ВРаботе");
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// rarus kabany 25.05.2021 17784 +++
	Если СписокПрисоединенныхФайловАдресс <> "" Тогда
	СкопироватьПрисоединенныеФайлы();	
	КонецЕсли;
	// rarus kabany 25.05.2021 17784 ---
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры
// rarus agar 26.04.2021 17394 --

// rarus kabany 26.05.2021 17784 +++
&НаСервере
Процедура СкопироватьПрисоединенныеФайлы()

Попытка
	мПрисоединенныхФайлов = ПолучитьИзВременногоХранилища(СписокПрисоединенныхФайловАдресс);
	РаботаСФайламиСлужебныйВызовСервера.СкопироватьФайлы(мПрисоединенныхФайлов, Объект.Ссылка);
Исключение
    ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции копирования вложений документа завершилось с ошибкой!'"),
        УровеньЖурналаРегистрации.Ошибка,
        ,
        ,
        ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    ВызватьИсключение;

КонецПопытки;

	КонецПроцедуры
// rarus kabany 26.05.2021 17784 ---
